//  Приклад встановлення системного часу (вашого компʼютера)//

#include <iarduino_RTC.h>                                   // Підключаємо бібліотеку iarduino_RTC для работи з модулями реального часу.

iarduino_RTC watch(RTC_DS1307);                         	// Оголошуємо обʼєкт watch для работи с RTC модулем на базі чипу DS1307, використовується шина I2C.

void setup(){
    delay(300);                                             // Чекаємо готовності модуля відповідати на запити.
    Serial.begin(9600);                                     // Ініціюємо передачу даних в монітор послідовного порта на швидкості 9600 бод.
    watch.begin();                                          // Ініціюємо роботу с модулем.
    watch.settime(__TIMESTAMP__);                           // Записуємо час компіляції скетчу в модуль.
}
void loop(){
    if(millis()%1000==0){                                   // Якщо пройшла 1 секунда.
      Serial.println(watch.gettime("d-m-Y, H:i:s, D"));     // Виводимо час.
      delay(1);                                             // Призупиняємо скетч на 1 мс, щоб не виводити час кілька разів за 1мс.
    }
}