//  Приклад зчитування поточного часу в змінні:		                    //
                                                                        //
#include <iarduino_RTC.h>                                               // Підключаємо бібліотеку iarduino_RTC для работи з модулями реального часу.

iarduino_RTC watch(RTC_DS1307);                                     	// Оголошуємо обʼєкт watch для работи с RTC модулем на базі чипу DS1307, використовується шина I2C.

uint8_t D, M, Y, h, m, s, W;                                            // Оголошуємо змінні для отримання наступних значень: D-день, M-місяць, Y-рік, h-години, m-хвилини, s-секунди, W-день тижня.

void setup(){
    delay(300);                                                         // Чекаємо готовності модуля відповідати на запити.
    Serial.begin(9600);                                                 // Ініціюємо передачу даних в монітор послідовного порта на швидкості 9600 бод.
    watch.begin();                                                      // Ініціюємо роботу с модулем.
} 
void loop(){
    if(millis()%1000==0){                                               // Якщо пройшла 1 секунда.
      watch.gettime();                                                  // Зчитуємо поточний час з модуля в буфер бібліотеки.
      D = watch.day;                                                    // Отримуємо з буфера бібліотеки поточний день місяца 1-31.
      M = watch.month;                                                  // Отримуємо з буфера бібліотеки поточний місяць       1-12.
      Y = watch.year;                                                   // Отримуємо з буфера бібліотеки поточний рік         0-99.
      h = watch.Hours;                                                  // Отримуємо з буфера бібліотеки поточну годину        0-23.
      m = watch.minutes;                                                // Отримуємо з буфера бібліотеки поточну хвилину      0-59.
      s = watch.seconds;                                                // Отримуємо з буфера бібліотеки поточну секунду     0-59.
      W = watch.weekday;                                                // Отримуємо з буфера бібліотеки поточний день тижня 0-6.
      Serial.println((String) D+"-"+M+"-"+Y+", "+h+":"+m+":"+s+", "+W); // Виводимо час в монітор, одним рядком.
      delay(1);                                                         // Призупиняємо скетч на 1 мс, щоб не виводити час кілька разів за 1мс.
    }
}