//  Приклад зчитування секунд, що пройшли з початку епохи Unix: //

#include <iarduino_RTC.h>                                   // Підключаємо бібліотеку iarduino_RTC для роботи з модулями реального времени.

iarduino_RTC watch(RTC_DS1307);                         	// Оголошуємо обʼєкт watch для роботи з RTC модулем на базі чипу DS1307, використовується шина I2C.

void setup(){
    delay(300);                                             // Чекаємо готовності модуля відповідати на запити.
    Serial.begin(9600);                                     // Ініціюємо передачу даних в монітор послідовного порта на швидкості 9600 бод.
    watch.begin();                                          // Ініціюємо роботу с модулем.
    watch.settimezone(3):                                   // Вказуємо свій часовий пояс. Так як час з початку епохи Unix рахується по грінвичу.
}
void loop(){
    if (millis()%1000==0){                                  // Якщо пройшла 1 секунда.
        Serial.println( watch.gettimeUnix() );              // Виводимо кількість секунд, що пройшли з початку епохи Unix (01.01.1970 00:00:00 GMT).
        delay(1);                                           // Призупиняємо скетч на 1 мс, щоб не виводити час кілька разів за 1мс.
    }
}